{ "previousExperience": [
  {
    "id": "next",
    "title": "What's next?",
    "experience": "I'm looking for my next opportunity, please reach out if you think I would be a good fit."
  },
  {
    "id": "oracle",
    "title": "Oracle",
    "experience": "At Oracle I worked as an Application Engineer, full-stack web developer, on the product Oracle Primavera Cloud. I worked on many features during my five years at the company with the highlights being implementing the ability to view costs in multiple currencies across 15+ pages in the app, implementing CRUD for a new resource management object on multiple pages, and implementing a scheduling algorithm for tasks. Focused on delivering a quality product I put emphasis on performance and test coverage, including the utilization of Test-Driven Development (TDD). I also had the opportunity to mentor and onboard numerous co-ops and new hires."
  },
  {
    "id": "targetx",
    "title": "TargetX",
    "experience": "At TargetX I worked as a Software Development Co-op. I designed and developed an offline mobile event check-in app for attendees to use at the Company's summits. I also implemented components of the upgraded events product for both web and mobile platforms. I helped increase developer productivity by designing and implementing a connector between tickets created by the customer support staff in Salesforce and defect reports received by developers in Rally. I also interfaced with customers by acting as a guide and answering product-related questions at the Company's annual CRM Summit."
  },
  {
    "id": "excite",
    "title": "ExCITe Center",
    "experience": "At Drexel University's ExCITe (Expressive and Creative Interactive Technology) Center I worked as the ExCITe Assistant, managing the Center's entire suite of webpages by creating new pages for new initiatives and editing existing pages to keep them up to date. I also worked on various implementations of web and application services for in-house display purposes that played throughout the center, keeping up with the latest news in Interactive Technology to find new content to display. I developed both a general and virtual tour iBook for visitors to view for an overview of the Center's activities. I also helped with event planning and support, interfacing with the Center's K-12, University, and industry partners."
  },
  {
    "id": "fiserv",
    "title": "Fiserv",
    "experience": "At Fiserv I worked as an Information Security Officer Intern, learning about what it takes to keep a secure network. I created and monitored systems daily using the Security Information Event Management System and other security reporting programs. I took part in the PCI (Payment Card Industry) Assessments and assisted in reviewing business policies against PCI requirements, tracking and submitting problems needing remediation through BMC Remedy. I corresponded with managers on a quarterly basis to review user access to secure servers. On my own initiative, I created and implemented Java programs to automate daily security procedures, such as User ID review and information retrieval from reports."
  }
]}